literate/AbstractSyntaxTreeTests.org
#+TITLE: Abstract Syntax Tree Tests
#+PROPERTY: header-args    :comments both :tangle ../test/AbstractSyntaxTree.test.js

#+begin_src js
import { AbstractSyntaxTree } from "../src/AbstractSyntaxTree"
import { Token } from "../src/LexicalToken"
import { Block, Tape } from "../src/Block"

describe("Basics", () => {
    it("Can be initialized", () => {
        const tree = AbstractSyntaxTree(true);
        expect(tree).toBeDefined();
        expect(tree.root).toBeTruthy();
    })
})
#+end_src

#+begin_src js
it("Can add Token to tape", () => {
    const tree = AbstractSyntaxTree();
    tree.appendBlock(Token.Number.factory("3"));
    expect(tree.tape.cells).toEqual(
        [Block(Token.Number.factory("3"))]);
})
#+end_src
